app/Controllers/Driver/Auth.php

SELECT *
FROM `tb_driver`
WHERE `username` = 'ronal'
 LIMIT 1
---
	public function auth_login()
	{
		$session = session();
		$model = new DriverModel();
		$username = $this->request->getVar('username');
		$password = $this->request->getVar('password');

		$data = $model->where('username', $username)->first();