app/Controllers/Customer/Order.php

INSERT INTO `tb_order` (`kode_order`, `id_pengantaran`, `id_customer`, `latitude`, `longitude`, `jarak_customer_to_bandara`, `tarif_perkm`, `biaya`) VALUES ('Mr8kc0lqVJ', '5', '10', '-0.0373469', '109.3316213', '16.2', '4200', '68040')
---
	public function submit_order()
	{
		$kode_order = $this->getToken(10);
		$id_pengantaran = $this->request->getPost('id_pengantaran');
		$id_customer = $this->request->getPost('id_customer');
		$latitude = $this->request->getPost('latitude');
		$longitude = $this->request->getPost('longitude');
		$jarak_customer_to_bandara = $this->request->getPost('jarak_customer_to_bandara');
		$tarif_perkm = $this->request->getPost('tarif_perkm');
		$biaya = $this->request->getPost('biaya');

		$customer = ($this->db->query("SELECT * FROM tb_customer WHERE id_customer='$id_customer' "))->getRow();
		$pengantaran = ($this->db->query("SELECT * FROM tb_pengantaran WHERE id_pengantaran='$id_pengantaran' "))->getRow();
		$driver = ($this->db->query("SELECT * FROM tb_driver WHERE id_driver='$pengantaran->id_driver' "))->getRow();

		$cek_orderan_proses = ($this->db->query("SELECT * FROM tb_order WHERE id_customer='$id_customer' AND status='0' LIMIT 1 "))->getNumRows();

		if ($cek_orderan_proses > 0) {
			echo json_encode(array(
				'success' => '0',
				'pesan' => 'Orderan gagal ditambahkan, anda masih memiliki orderan yang belum selesai !'
			));
		} else {
			$this->OrderModel->save([
				'kode_order' => $kode_order,
				'id_pengantaran' => $id_pengantaran,
				'id_customer' => $id_customer,
				'latitude' => $latitude,
				'longitude' => $longitude,
				'jarak_customer_to_bandara' => $jarak_customer_to_bandara,
				'tarif_perkm' => $tarif_perkm,
				'biaya' => $biaya
			]);