app/Models/AdminModel.php

SELECT *
FROM `tb_admin`
WHERE `id_admin` = '1'
 LIMIT 1
---
	public function getAdmin($id_admin = false)
	{
		if ($id_admin == false) {
			return $this->orderBy('id_admin', 'desc')->findAll();
		}
		return $this->where(['id_admin' => $id_admin])->first();