app/Models/BandaraModel.php

SELECT *
FROM `tb_bandara`
ORDER BY `id_bandara` DESC
---
	public function getBandara($id_bandara = false)
	{
		if ($id_bandara == false) {
			return $this->orderBy('id_bandara', 'desc')->findAll();