app/Models/CustomerModel.php

	public function getCustomer($id_customer = false)
	{
		if ($id_customer == false) {
			return $this->orderBy('id_customer', 'desc')->findAll();
		}
		return $this->where(['id_customer' => $id_customer])->first();
---
SELECT *
FROM `tb_customer`
WHERE `id_customer` = '1'
 LIMIT 1

	public function getCustomerByGoogleId($google_id)
	{
		return $this->where([
			'google_id' => $google_id
		])->first();
---
SELECT *
FROM `tb_customer`
WHERE `google_id` = '107499557051092078219'
 LIMIT 1

	public function updateCustomer($data, $id)
	{
		$query = $this->db->table($this->table)->update($data, array('id_customer' => $id));
---
UPDATE `tb_customer` SET `latitude` = '-0.0425984', `longitude` = '109.314048'
WHERE `id_customer` = '9'