app/Models/DriverModel.php

SELECT *
FROM `tb_driver`
WHERE `id_driver` = '2'
 LIMIT 1
---
	public function getDriver($id_driver = false)
	{
		if ($id_driver == false) {
			return $this->orderBy('id_driver', 'desc')->findAll();

SELECT *
FROM `tb_driver`
WHERE `aktif` = 'Y'
ORDER BY `id_driver` DESC
---
	public function getDriverAktif()
	{
		return $this->where([
			'aktif' => 'Y'
		])->orderBy('id_driver', 'DESC')->findAll();

UPDATE `tb_driver` SET `latitude` = '-0.0263303', `longitude` = '109.3425039'
WHERE `id_driver` = '2'
---
	public function updateDriver($data, $id)
	{
		$query = $this->db->table($this->table)->update($data, array('id_driver' => $id));