app/Models/PengantaranModel.php

SELECT *
FROM `tb_pengantaran`
WHERE `id_driver` = '2'
ORDER BY `id_pengantaran` DESC
---
	public function getPengantaranByIdDriver($id_driver)
	{
		return $this->where([
			'id_driver' => $id_driver
		])->orderBy('id_pengantaran', 'desc')->findAll();

SELECT *
FROM `tb_pengantaran`
WHERE `status_pengantaran` = '0'
---
	public function getPengantaranProses()
	{
		return $this->where([
			'status_pengantaran' => '0'
		])->findAll();