app/Models/PushNotifModel.php

	public function deletePushNotif($id)
	{
		return $this->db->table($this->table)->delete(['id_push_notif' => $id]);
---
UPDATE `tb_push_notif` SET `p256dh` = 'BN53+i1qhDXCE1NlPz9k4RIkbzXOi/Jv3cP3m/hcO/Cm+XBo23hhHxT3/BPUvqthiYe5VP//NF5FR0jM/Ja36Wc=', `auth` = 'Js8T0y/is8jr9plMXQ4Lpw=='
WHERE `id_push_notif` = '5'