app/Models/TarifModel.php

	public function getTarif($id_tarif = false)
	{
		if ($id_tarif == false) {
			return $this->orderBy('id_tarif', 'desc')->findAll();
		}
		return $this->where(['id_tarif' => $id_tarif])->first();
---
SELECT *
FROM `tb_tarif`
WHERE `id_tarif` = 1
 LIMIT 1